app/views/movies/index.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = 1
---
			<li><%= link_to movie.name, movie %>
					<% movie.reviews.each do |review| %>