app/views/movies/show.html.erb


          <% @movie.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = 5