app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(params[:movie])

    if @movie.save
---
INSERT INTO "movies" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Wed, 19 Dec 2012 21:49:48 UTC +00:00], ["name", "Fantastic Mr. Fox"], ["updated_at", Wed, 19 Dec 2012 21:49:48 UTC +00:00]]