app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("created_at", "description", "kind", "movie_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Thu, 20 Dec 2012 03:18:54 UTC +00:00], ["description", "two thumbs up!"], ["kind", "positive"], ["movie_id", 1], ["updated_at", Thu, 20 Dec 2012 03:18:54 UTC +00:00]]
---
  def create
    authenticate_user!
  	@review = Review.new(params[:review])
  	@movie = @review.movie

    if @review.save